app/controllers/cards_controller.rb

  def index
    cards = Card.all.shuffle[0..6].take(6)
---
SELECT "cards".* FROM "cards"