app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    games = Game.sort_by_score.take(5);

INSERT INTO "games" ("player_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["player_id", 4], ["score", 2], ["created_at", "2020-03-26 13:45:04.416387"], ["updated_at", "2020-03-26 13:45:04.416387"]]
---
  def create
    game = Game.create(player_id: params[:player_id], score: params[:score])