app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
    def index
        players = Player.all

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2020-03-24 18:29:11.125965"], ["updated_at", "2020-03-24 18:29:11.125965"]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
---
    def create
        @player = Player.find_or_create_by(name: params[:name])