app/controllers/sessions_controller.rb

    def create
        player = Player.find_by_name(params[:name])
---
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]