app/models/game.rb

SELECT "games".* FROM "games"
---
  def self.sort_by_score
    self.all.sort_by {|g| -g.score}